// Напишите программу, которая принимает число и выдает его квадрат
Console.WriteLine("Enter a number: ");
int number = Convert.ToInt32 (Console.ReadLine());
int square = number * number; 
Console.WriteLine($"Square of {number} = {square} ");
