//  Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным
Console.WriteLine("Enter the number of the day of the week to know if it is a weekend");
int day = Convert.ToInt32(Console.ReadLine());
if (7-day<2)
{
    Console.WriteLine("Yes");
}
else 
{
    Console.WriteLine("No");
}